//
//
///*
//作者：闫竞存
//时间：2019.10.31
//内容：1!+2!+3!……+m！=n
//
//*/
///*版权所有
//1.版权归原作者闫竞存所有
//2.未经原作者允许不得转载本文内容，否则将视为侵权
//3.转载或者引用本文内容请注明来源及原作者
//4.对于不遵守此声明或者其他违法使用本文内容者，本人依法保留追究权等。
//*/
//
//
//
//
//#include<stdio.h>
//
//int main ()
//
//{
//	int m , n , i , j , s = 0 , t , x ;
//
//	printf("please enter the value of 'n' : ");
//	scanf("%d",&n);
//
//	for (  m = 1 , x = 0 ; s <= n ; m++ , x++ )
//	{
//		for ( i = 1 , t = 1 ; i <= m ; i++)
//		{
//			t = i * t ;
//			s = s + t ;
//		}
//		if ( s > n ) break;
//
//
//	}
//
//	printf("m=%d\n",x);
//
//	return 0 ;
//}
