% % 求解方程的根
% % 建立多项式系数向量
% p = [2, 0, -3, 71, -9 13];
% x = roots(p); % 求根


% a = [2, 3, -1; 8, 2, 3; 45, 3, 9]; % 建立系数矩阵a
% b = [2; 4; 23]; % 建立列向量b
% z = inv(a) * b;

% syms x y z;
% [x, y ,z] = solve(2*x+3*y-z-z, 8*x+2*y+3*z-4, 45*x+3*y+9*z-23);

% quad('x.*log(1+x)', 0, 1); % 积分


% % 考虑以下实验数据
% x = [1:1:10];
% y = [1.2, 3, 4, 4, 5, 4.7, 5, 5.2, 6, 7.2];

% % 一次多项式拟合
% p1 = polyfit(x, y, 1);

% % 三次多项式拟合
% p3 = polyfit(x, y, 3);

% % 画出原始数据和拟合曲线
% x2 = 1:0.1:10;
% y1 = polyval(p1, x2);
% y3 = polyval(p3, x2);
% plot(x, y, '*', x2, y1, ':', x2, y3);

